---
kind: property
id: P:Autodesk.Revit.DB.OverrideGraphicSettings.IsCutForegroundPatternVisible
source: html/8774096d-548d-54a5-2276-445b6bae3bfc.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.IsCutForegroundPatternVisible Property

The visibility of the cut face foreground fill pattern.

## Syntax (C#)
```csharp
public bool IsCutForegroundPatternVisible { get; }
```